package org.jarvis.organization.wzgroup;

import org.jsoup.Jsoup;
import org.jsoup.nodes.Document;
import org.jsoup.Connection;
import org.json.JSONObject;

public class AddressInfo {

    public String getAddressInfo(String name) {
        String data = "";
        try {
            Connection connection = Jsoup.connect("http://118.31.54.4:5001/ent_credit/parse_address/?name=" + name);
            connection.ignoreContentType(true);
            connection.timeout(2000);
            connection.userAgent("Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_4) " +
                    "AppleWebKit/537.36 (KHTML, like Gecko) " +
                    "Chrome/81.0.4044.122 Safari/537.36");
            Document document = connection.get();
            JSONObject jsonObject = new JSONObject(document.text());
            JSONObject datas = jsonObject.getJSONObject("datas");
            String province = datas.get("province").toString();
            String city = datas.get("city").toString();
            data = data + province + "," + city;

        } catch (Exception e) {
            data = data + "null" + "," + "null";

        }
        return data;

    }

    public static void main(String[] args) throws Exception {
        AddressInfo addressInfo = new AddressInfo();
        String[] city = {"南京青龙山国际生态新城","长沙梅溪湖国际新城","青岛中欧国际城","青岛即墨国际智慧新城","青岛西海岸创新科技城","温州瓯江国际新城","温州瑞安生态科学城","苏州张家港智慧科学城","三亚南繁科技城","宁波生命科学城","无锡霞客岛生态城","广州中化现代农业科学城","岳阳洞庭生态创新城","嘉兴上海之窗智慧科学城","福州滨海金茂智慧科学城","郑州二七区马寨新城","武汉方岛金茂智慧科学城","天津上东金茂智慧科学城","苏州常熟金茂智慧科学城","青岛大云谷城市运营项目","温州鳌江国际新城","金华金茂未来科学城","上海金茂北外滩","杭州金茂星外滩","丽江金茂谷镇","南京汤山温泉康养小镇","丹阳眼镜风尚小镇","金茂北京威斯汀大饭店","北京金茂万丽酒店","北京金茂怡生园酒店","上海金茂君悦大酒店","上海崇明金茂凯悦酒店","金茂深圳JW万豪酒店","金茂三亚丽思卡尔顿酒...","金茂三亚希尔顿大酒店","长沙梅溪湖金茂豪华精...","南京金茂威斯汀大酒店","丽江金茂酒店","丽江金茂璞修雪山酒店","西安鼓楼金茂酒店","莫干山金茂天籁之梦度...","长沙金茂览秀城","张家港金茂览秀城","武汉金茂览秀城","青岛金茂览秀城","杭州金茂览秀城","福州金茂览秀城","天津金茂汇","南京金茂汇","宁波金茂汇","上海J·LIFE","上海北外滩J·LIF...","丽江J·LIFE","青岛金茂湾购物中心","上海金茂大厦","北京凯晨世贸中心","北京中化大厦","北京朝阳金茂中心","金茂绿创中心","南京绿地金茂国际金融...","长沙金茂ICC","北京未来金茂府","北京亦庄金茂府","北京金茂府","北京金茂府二期","北京东叁金茂府","北京望京金茂府","北京广渠金茂府","北京颐和金茂府","天津上东金茂府","天津海河金茂府","济南奥体金茂府","济南旅游路金茂府","郑州北龙湖金茂府","武汉滨江金茂府","武汉东湖金茂府","长沙梅溪湖金茂府","上海虹口金茂府","上海大宁金茂府","上海西郊金茂府","杭州东城金茂府","杭州金茂府","杭州滨江金茂府","金华义乌福田金茂府","苏州科技城金茂府","苏州姑苏金茂府","宁波南塘金茂府","宁波江东金茂府","宁波海曙金茂府","嘉兴嘉禾金茂府","宁波姚江金茂府","温州鹿城金茂府","温州九山金茂府","嘉兴秀湖金茂府","成都武侯金茂府","南京玄武湖金茂府","南京河西金茂府","重庆龙兴金茂府","无锡澄江金茂府","徐州楚河金茂府","常州龙城金茂府","无锡蠡湖金茂府","常州春秋金茂府","南通崇川金茂府","广州珠江金茂府","福州鼓楼金茂府","深圳龙华金茂府","广州天河金茂广场","西安未央金茂府","太原龙城金茂府","青岛大云谷崂山金茂府","西安长安金茂府","泰州凤城金茂府","北京大兴金茂悦","北京亚奥金茂悦","北京亦庄金茂悦","北京台湖金茂悦","张家口京北金茂悦","保定竞秀金茂悦","青岛市南金茂湾","济南雪山金茂悦","威海凤集金茂悦","长沙梅溪湖金茂悦","长沙岳麓金茂梅溪湖","长沙梅溪湖金茂湾","南昌九龙湖金茂悦","上海虹桥金茂悦","株洲金茂悦","杭州黄龙金茂悦","苏州姑苏金茂悦","宁波宁南金茂悦","宁波海湾金茂悦","宁波海曙金茂悦","湖州仁皇金茂悦","重庆大坪金茂珑悦","重庆盘龙金茂悦","重庆璧山金茂悦","成都天府金茂悦","南京鱼嘴金茂悦","南京扬子江金茂悦","南京东城金茂悦","南京江宁金茂悦","合肥滨湖金茂悦","合肥北雁湖金茂湾","徐州云龙金茂悦","佛山朝安金茂悦","广州南沙金茂悦","福州奥体金茂悦","武汉阳逻金茂悦","厦门翔安金茂悦","三亚金茂湾","珠海湖心金茂悦","石家庄长安金茂悦","烟台幸福金茂悦","北京亦庄金茂逸墅","济南雪山金茂逸墅","济南高新金茂墅","武汉阳逻金茂逸墅","上海崇明金茂逸墅","宁波慈城金茂逸墅","丽江玉龙金茂雪山语","南京固城湖金茂逸墅","无锡太湖金茂逸墅","绍兴镜湖金茂逸墅","佛山金茂绿岛湖","东莞清溪金茂逸墅"};

        for (String str : city) {
            System.out.println(addressInfo.getAddressInfo(str));

        }
    }
}
